tap "qmk/qmk"
tap "yarlson/lnk"
tap "ybeapps/sourcegit"
brew "asciinema"
brew "ast-grep"
brew "ncurses"
brew "bash"
brew "bat"
brew "binwalk"
brew "cmake"
brew "cocoapods"
brew "curl"
brew "fastfetch"
brew "ffmpeg"
brew "fish"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-credential-libsecret"
brew "git-filter-repo"
brew "git-lfs"
brew "pinentry"
brew "gnupg"
brew "go"
brew "gollama"
brew "graphviz"
brew "grep"
brew "hub"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "magic-wormhole"
brew "mas"
brew "mergiraf"
brew "mkcert"
brew "neovim"
brew "ollama"
brew "openssh"
brew "pandoc"
brew "pinentry-mac"
brew "premake"
brew "python@3.12"
brew "ripgrep"
brew "shfmt"
brew "sops"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "ttyd"
brew "wget"
brew "zsh"
brew "yarlson/lnk/lnk"
cask "1password"
cask "1password-cli"
cask "affinity"
cask "airbuddy"
cask "balenaetcher"
cask "betterdisplay"
cask "cap"
cask "chatwise"
cask "cleanmymac"
cask "cleanshot"
cask "clop"
cask "cursor"
cask "cyberduck"
cask "dbngin"
cask "discord"
cask "dotnet-sdk"
cask "expo-orbit"
cask "figma"
cask "font-host-grotesk"
cask "font-sf-mono-for-powerline"
cask "fork"
cask "ghostty"
cask "git-credential-manager"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "helium-browser"
cask "homerow"
cask "imageoptim"
cask "keyboardcleantool"
cask "lm-studio"
cask "logi-options+"
cask "loopback"
cask "mac-mouse-fix"
cask "macs-fan-control"
cask "master-pdf-editor"
cask "mist"
cask "obs"
cask "opencode-desktop"
cask "orbstack"
cask "proxyman"
cask "qflipper"
cask "raycast"
cask "rode-connect"
cask "screen-studio"
cask "signal"
cask "sketch"
cask "slack"
cask "tableplus"
cask "tailscale-app"
cask "termius"
cask "tuxera-ntfs"
cask "visual-studio-code"
cask "vlc"
cask "webtorrent"
cask "whatsapp"
cask "yaak"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "alto.computer", id: 6480425094
mas "alto.index", id: 6746674846
mas "alto.photos", id: 6737197282
mas "Boxy SVG", id: 611658502
mas "ColorSlurp", id: 1287239339
mas "Cursor Pro", id: 1447043133
mas "DaisyDisk", id: 411643860
mas "Developer", id: 640199958
mas "Entity Pro", id: 1503988785
mas "Equinox", id: 1591510203
mas "Harvest", id: 506189836
mas "iMovie", id: 408981434
mas "Kagi for Safari", id: 1622835804
mas "Keynote", id: 409183694
mas "Lungo", id: 1263070803
mas "Monodraw", id: 920404675
mas "NextDNS", id: 1464122853
mas "Noir", id: 1592917505
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Refined GitHub", id: 1519867270
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Velja", id: 1607635845
mas "Xcode", id: 497799835
vscode "1password.op-vscode"
vscode "aaron-bond.better-comments"
vscode "adpyke.vscode-userscript"
vscode "anysphere.csharp"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-containers"
vscode "ast-grep.ast-grep-vscode"
vscode "astro-build.astro-vscode"
vscode "bierner.comment-tagged-templates"
vscode "bierner.folder-source-actions"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "dakara.transformer"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dnicolson.binary-plist"
vscode "drknoxy.eslint-disable-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-theme"
vscode "expo.vscode-expo-tools"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "jdinhlife.gruvbox"
vscode "jock.svg"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "marp-team.marp-vscode"
vscode "mikestead.dotenv"
vscode "mkhl.shfmt"
vscode "monokai.theme-monokai-pro-vscode"
vscode "motion.motion-vscode-extension"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.wasm-wasi-core"
vscode "ms-vsliveshare.vsliveshare"
vscode "mylesmurphy.prettify-ts"
vscode "ndonfris.fish-lsp"
vscode "nuxt.mdc"
vscode "orta.vscode-jest"
vscode "orta.vscode-twoslash-queries"
vscode "oven.bun-vscode"
vscode "pustelto.bracketeer"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "repreng.csv"
vscode "rust-lang.rust-analyzer"
vscode "sanity-io.vscode-sanity"
vscode "sburg.vscode-javascript-booster"
vscode "sourcegraph.amp"
vscode "sst-dev.opencode"
vscode "styled-components.vscode-styled-components"
vscode "swiftlang.swift-vscode"
vscode "tamasfe.even-better-toml"
vscode "tldraw-org.tldraw-vscode"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "unifiedjs.vscode-remark"
vscode "vitest.explorer"
vscode "vue.volar"
vscode "wmaurer.change-case"
vscode "yoavbls.pretty-ts-errors"
vscode "yunduo.color-highlight-css-color-4"
vscode "zachhardesty.convert-object-to-jsx-vscode"
vscode "zengxingxin.sort-js-object-keys"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
