tap "atlassian/acli"
tap "supabase/tap"
tap "tw93/tap"
tap "yarlson/lnk"
# Run your GitHub Actions locally
brew "act"
# Record and share terminal sessions
brew "asciinema"
# Code searching, linting, rewriting
brew "ast-grep"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Official Amazon AWS command-line interface
brew "awscli"
# Text-based UI library
brew "ncurses"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# CLI application for interacting with a Cloudflare account
brew "flarectl"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Multi-platform software reverse engineering framework
brew "ghidra"
# Distributed revision control system
brew "git"
# Git helper for accessing credentials via libsecret
brew "git-credential-libsecret"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Tool to unpack installers created by Inno Setup
brew "innoextract"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq", link: true
# Securely transfers data between computers
brew "magic-wormhole"
# Mac App Store command-line interface
brew "mas"
# Syntax-aware git merge driver
brew "mergiraf"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Create, run, and share large language models (LLMs)
brew "ollama"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Write once, build anywhere Lua-based build system
brew "premake"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Autoformat shell script source code
brew "shfmt"
# Editor of encrypted files
brew "sops"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line tool for sharing terminal over the web
brew "ttyd"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Software to interact with Atlassian Cloud from the terminal
brew "atlassian/acli/acli", trusted: true
# Supabase CLI
brew "supabase/tap/supabase", trusted: true
# Comprehensive macOS cleanup and application uninstall tool
brew "tw93/tap/mole", trusted: true
# Git-native dotfiles management that doesn't suck
brew "yarlson/lnk/lnk", trusted: true
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# AirPods companion app
cask "airbuddy"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Display management tool
cask "betterdisplay"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Screen capturing tool
cask "cleanshot"
# Image, video and clipboard optimiser
cask "clop"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Write, edit, and chat about your code with AI
cask "cursor"
# Server and cloud storage browser
cask "cyberduck"
# Database version management tool
cask "dbngin"
# Voice and text chat software
cask "discord"
# Collaborative team software
cask "figma"
cask "font-inter"
cask "font-inter-tight"
cask "font-sf-mono-for-powerline"
# GIT client
cask "fork"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Chromium-based web browser
cask "helium-browser"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# Tool to optimise images to a smaller size
cask "imageoptim"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Discover, download, and run local LLMs
cask "lm-studio"
# Cable-free audio router
cask "loopback"
# Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask "mac-mouse-fix"
# File system integration
cask "macfuse"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# PDF editor
cask "master-pdf-editor"
# Utility that automatically downloads firmwares and installers
cask "mist"
# Open-source software for live streaming and screen recording
cask "obs"
# Professional webcam software for the Opal C1
cask "opal-composer"
# AI coding agent desktop client
cask "opencode-desktop"
# Local-first alternative to Logitech Options+ for HID++ devices
cask "openlogi"
# Replacement for Docker Desktop
cask "orbstack"
# Desktop virtualization software
cask "parallels"
# HTTP debugging proxy
cask "proxyman"
# Companion app for Flipper Zero devices
cask "qflipper"
# Screen recorder and editor
cask "screen-studio"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Video game digital distribution service
cask "steam"
# Application for inspecting installer packages
cask "suspicious-package"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# File system and storage management software
cask "tuxera-ntfs"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Torrent streaming application
cask "webtorrent"
# Native desktop client for WhatsApp
cask "whatsapp"
# REST, GraphQL and gRPC client
cask "yaak"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Affinity Designer", id: 824171161
mas "Boxy SVG", id: 611658502
mas "ColorSlurp", id: 1287239339
mas "Cursor Pro", id: 1447043133
mas "DaisyDisk", id: 411643860
mas "Developer", id: 640199958
mas "Entity Pro", id: 1503988785
mas "Equinox", id: 1591510203
mas "Harvest", id: 506189836
mas "Lungo", id: 1263070803
mas "Monodraw", id: 920404675
mas "NextDNS", id: 1464122853
mas "Noir", id: 1592917505
mas "Pixelmator Pro", id: 1289583905
mas "Prime Video", id: 545519333
mas "Refined GitHub", id: 1519867270
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Velja", id: 1607635845
vscode "1password.op-vscode"
vscode "aaron-bond.better-comments"
vscode "adpyke.vscode-userscript"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-containers"
vscode "anysphere.remote-ssh"
vscode "astro-build.astro-vscode"
vscode "bierner.comment-tagged-templates"
vscode "bierner.folder-source-actions"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "dakara.transformer"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dnicolson.binary-plist"
vscode "drknoxy.eslint-disable-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-theme"
vscode "expo.vscode-expo-tools"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitpod.gitpod-theme"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "jock.svg"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "marp-team.marp-vscode"
vscode "matthewpi.caddyfile-support"
vscode "mikestead.dotenv"
vscode "mkhl.shfmt"
vscode "motion.motion-vscode-extension"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.wasm-wasi-core"
vscode "ms-vsliveshare.vsliveshare"
vscode "mylesmurphy.prettify-ts"
vscode "ndonfris.fish-lsp"
vscode "nuxt.mdc"
vscode "onesoftqwq.opencode-go-copilot-provider"
vscode "openai.chatgpt"
vscode "orta.vscode-jest"
vscode "orta.vscode-twoslash-queries"
vscode "oven.bun-vscode"
vscode "prisma.prisma"
vscode "pustelto.bracketeer"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "repreng.csv"
vscode "rust-lang.rust-analyzer"
vscode "sburg.vscode-javascript-booster"
vscode "sonarsource.sonarlint-vscode"
vscode "styled-components.vscode-styled-components"
vscode "swiftlang.swift-vscode"
vscode "tamasfe.even-better-toml"
vscode "tldraw-org.tldraw-vscode"
vscode "tomoki1207.pdf"
vscode "unifiedjs.vscode-mdx"
vscode "unifiedjs.vscode-remark"
vscode "vitest.explorer"
vscode "vue.volar"
vscode "wallabyjs.quokka-vscode"
vscode "wmaurer.change-case"
vscode "yoavbls.pretty-ts-errors"
vscode "yunduo.color-highlight-css-color-4"
vscode "yzhang.markdown-all-in-one"
vscode "zachhardesty.convert-object-to-jsx-vscode"
vscode "zengxingxin.sort-js-object-keys"
go "github.com/mvanhorn/cli-printing-press/v4/cmd/cli-printing-press"
go "github.com/grikomsn/codex-chat-manager/cmd/codex-chat-manager"
go "golang.org/x/tools/cmd/goimports"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
uv "marker-pdf[full]"
uv "markitdown[all]"
uv "streamlit"
npm "@earendil-works/pi-coding-agent"
npm "command-code"
npm "corepack"
npm "fish-lsp"
npm "neovim"
npm "prettier"
npm "serve"
npm "tsx"
npm "turbo"
npm "vercel"
